from math import sqrt

a, b, c, m, n, x, y = range(1, 8)

# 1
val1 = -1/x**2
val2 = a / (b * c)
val3 = c/b*c
val4 = (a + b)/2
val5 = 0
val6 = (-b + sqrt(b**2 - 4 * a * c)) / (2 * a)
val7 = (-b+1/a) / (2/c)
val8 = 1 / 1 + (a+b)/2
val9 = 1 / 1 + 1 / 2 + 1 / 2 + 3 / 5
val10 = 2 ** m ** n


'''3. Определите значение переменной cпосле выполнения следующего фрагмента программы:
a = 5
a = a + 6
b = –a
c = a – 2 * b
------

a = 11
b = -11
c = 11-2*(-11) = -11 '''


'''4. Определите значение переменной v после выполнения следующего фрагмента программы:
a = 40
b = 10
b = –а/2 * b
v = b + a * 2
------

a = 40
b = -40/2 * 10 = -200
v = -200 + 40 * 2 = -120 '''


'''5. Определите значения переменных s и k после выполнения
следующего фрагмента программы:
s = 14
k = –3
d = s + 1
s = d
k = 2 * s
-------

d = 14 + 1 = 15
s = 15
k = 2 * 15 = 30 '''


''' 6. Определите значения переменных p и q после выполнения
следующего фрагмента программы:
p= 0
q = 30
d = q – 5
q = 2 * d
p = q – 100
---------

d = 30-5 = 25
q = 2 * 25 = 50
p = 50 - 100 = -50 '''


'''7. Вычислите значение переменной z при x = 25 и y = 7:
а) z = x % y + y
б) z = x//y + x
в) y = x//y
z = x//y
г) y = x//y + y
z = x % y + x
д) y = x % y + 4
z = x % y + 1
е) y = x//y
z = x % (y + 1)
ж) y = x % y
z = x//(y + 1)
------------------


